//  Даны целые положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное
// количество отрезков длины B (без наложений). Используя операцию взятия остатка от деления нацело, найти
// длину незанятой части отрезка A.

Console.WriteLine("Hello, World!");